app/controllers/school_classes_controller.rb

	def create
		@school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-03-01 16:11:27.917530"], ["updated_at", "2017-03-01 16:11:27.917530"]]